// pages/table/table.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    tablearray:[
      {
      tabletitle:'基本信息',
      carinfo:[{td1:'经销商报价',td2:'40万'},
               {td1:'厂商',td2:'雷克萨斯'},
               {td1:'级别',td2:'中大型车'},
               {td1:'能源类型',td2:'汽油'},
               {td1:'上市时间',td2:'2019.09'},
               {td1:'发动机',td2:'2.5L 207马力 L4'},
               {td1:'最大功率(kW)',td2:'152(207Ps)'},
               {td1:'最大扭矩(N·m)',td2:'243'},
               {td1:'变速箱',td2:'8档手自一体'},
               {td1:'长x宽x高(mm)',td2:'4975x1866x1447'},
               {td1:'车身结构',td2:'4门5座三厢车'},
               {td1:'最高车速(Km/h)',td2:'210'},
               {td1:'官方百公里加速时间(s)',td2:'9.1'},
               {td1:'工信部百公里油耗(L)',td2:'6.3'},
               {td1:'整车保修期限',td2:'4年或10万公里'}]
    },
    {
      tabletitle:'车身',
      carinfo:[{td1:'长(mm)',td2:'4975'},
               {td1:'宽(mm)',td2:'1866'},
               {td1:'高(mm)',td2:'1447'},
               {td1:'轴距(mm)',td2:'2870'},
               {td1:'前轮距(mm)',td2:'1589'},
               {td1:'后轮距(mm)',td2:'1599'},
               {td1:'最小离地间隙(mm)',td2:'-'},
               {td1:'车身结构',td2:'三厢车'},
               {td1:'车门数(个)',td2:'4'},
               {td1:'车门开启方式',td2:'平开门'},
               {td1:'座位数(个)',td2:'5'},
               {td1:'整备质量(Kg)',td2:'1645'},
               {td1:'满载质量(Kg)',td2:'2110'},
               {td1:'油箱容积(L)',td2:'60.6'},
               {td1:'行李舱容积(L)',td2:'454'}]
    }],

    
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})